class Solution {
public:
    /**
    *十进制：5+7=12
    *第一步：不考虑进位得到2
    *第二步：考虑进位得到10
    *第三步：前两步结果相加没有进位了10+2 = 12如有进位再重复前面的步骤
    *转化为二进制位运算 5-101,7-111
    *第一步：不考虑进位结果为010，也就是1和1相加为0,0和0相加为0,0和1相加为1，结果同异或操作，
    *第二步：进位结果为1010，相当于101左移一位，101是010和111的位与运算
    *第三步：前两步结果相加，1010+010(按之前的方法重复前两步，直到没有进位，也就是两个位与运算结果为0)
    */
    int Add(int num1, int num2)
    {
        int sum,carry;
        do{
            sum = num1^num2;
            carry = (num1&num2)<<1;
            num1 = sum;
            num2 = carry;
        }while(num2!=0);
        return num1;
    }
};